Процедура ЗаписатьДанныеВZato(partner_id, balance) Экспорт

    ИмяФайлаЗапроса = СформироватьДанныеДляPOSTЗапроса(partner_id, balance);
    ИмяФайлаОтвета   = ПолучитьИмяВременногоФайла("xml");

    // формирование заголовка
    Заголовок = Новый Соответствие;
    Заголовок.Вставить("Content-Type", "application/x-www-form-urlencoded");
    Заголовок.Вставить("Content-Length", XMLСтрока(РазмерФайла(ИмяФайлаЗапроса)));

    // отправка запроса и получение ответа
    Соединение = Новый HTTPСоединение("192.168.157.5", 11223, , , , 3,);
    Соединение.ОтправитьДляОбработки(ИмяФайлаЗапроса, "partner_update_balance", ИмяФайлаОтвета, Заголовок);
    Результат = ИмяФайлаОтвета;

    УдалитьФайлы(ИмяФайлаОтвета);

    УдалитьФайлы(ИмяФайлаЗапроса);

КонецПроцедуры

Функция РазмерФайла(ИмяФайла)
    Файл = Новый Файл(ИмяФайла);
    Возврат Файл.Размер();
КонецФункции

Функция СформироватьДанныеДляPOSTЗапроса(partner_id, balance)

    ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла("xml");

    ТелоЗапросаXML = Новый ЗаписьXML;
    ТелоЗапросаXML.ОткрытьФайл(ИмяФайлаЗапроса, "UTF-8");

    ТелоЗапросаXML.ЗаписатьОбъявлениеXML();

    ТелоЗапросаXML.ЗаписатьНачалоЭлемента("root");
        ТелоЗапросаXML.ЗаписатьНачалоЭлемента("balance");
        ТелоЗапросаXML.ЗаписатьТекст(balance);
        ТелоЗапросаXML.ЗаписатьКонецЭлемента();

        ТелоЗапросаXML.ЗаписатьНачалоЭлемента("partner_id");
        ТелоЗапросаXML.ЗаписатьТекст(partner_id);
        ТелоЗапросаXML.ЗаписатьКонецЭлемента();
    ТелоЗапросаXML.ЗаписатьКонецЭлемента();

    ТелоЗапросаXML.Закрыть();

    Возврат ИмяФайлаЗапроса;

КонецФункции // СформироватьДанныеДляPOSTЗапроса()
